load-test-user-post.yml
config:
  target: "{{ $processEnvironment.ART_TARG }}"
  phases:
    - duration: 5
      arrivalRate: 1
    - duration: 3
      arrivalRate: 5
      rampTo: 20
  processor: "./load-test-helpers.js"

scenarios:
  - name: 'Request a user via POST'
    flow:
    - post:
        headers:
          Content-Type: "application/json"
        url: "{{ $processEnvironment.SIM_GQL_PATH }}"
        json:
          query: 'query($name:String){user(name:$name){id name address email role}}'
          variables: '{"name":"Jack Bosco"}'
        # afterResponse: "logRes"